Revit 2027 API
BuiltInFailures.MassFailures.CannotMoveMassing Property
 Can't move whole Massing. Move the elements within the Massing instead.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotMoveMassing { get; }
Public Shared ReadOnly Property CannotMoveMassing As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotMoveMassing {
	FailureDefinitionId^ get ();
}
static member CannotMoveMassing : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MassFailures Class
Autodesk.Revit.DB Namespace